; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_1 object type_3 type_2)
 (:predicates (pred_3 ?v3 - type_3 ?v5 - type_1)
 	      (pred_4 ?v2 - object ?v5 - type_1)
	      (pred_2 ?v3 - type_3 ?v4 - type_2)
	      (pred_1 ?v3 - type_3 ?v2 - object ?v4 - type_2))

   (:action op_3
       :parameters  (?v3 - type_3 ?v1 ?v8 - type_1)
       :precondition (and  (pred_3 ?v3 ?v1))
       :effect (and  (pred_3 ?v3 ?v8)
		     (not (pred_3 ?v3 ?v1))))

   (:action op_1
       :parameters (?v3 - type_3 ?v7 - object ?v6 - type_1 ?v4 - type_2)
       :precondition  (and  (pred_4 ?v7 ?v6) (pred_3 ?v3 ?v6) (pred_2 ?v3 ?v4))
       :effect (and (pred_1 ?v3 ?v7 ?v4)
		    (not (pred_4 ?v7 ?v6)) 
		    (not (pred_2 ?v3 ?v4))))

   (:action op_2
       :parameters (?v3 - type_3 ?v7 - object ?v6 - type_1 ?v4 - type_2)
       :precondition  (and  (pred_1 ?v3 ?v7 ?v4) (pred_3 ?v3 ?v6))
       :effect (and (pred_4 ?v7 ?v6)
		    (pred_2 ?v3 ?v4)
		    (not (pred_1 ?v3 ?v7 ?v4)))))

; problem
(define (problem gripper-2-3-3)
(:domain gripper-strips)
(:objects obj_10 obj_02 - type_3
obj_09 obj_04 obj_06 obj_08 - type_2
obj_12 obj_07 obj_05 - type_1
obj_01 obj_11 obj_03 - object)
(:init
(pred_3 obj_10 obj_05)
(pred_2 obj_10 obj_09)
(pred_2 obj_10 obj_04)
(pred_3 obj_02 obj_07)
(pred_2 obj_02 obj_06)
(pred_2 obj_02 obj_08)
(pred_4 obj_01 obj_05)
(pred_4 obj_11 obj_05)
(pred_4 obj_03 obj_05)
)
(:goal
(and
(pred_4 obj_01 obj_12)
(pred_4 obj_11 obj_05)
(pred_4 obj_03 obj_05)
)
)

(:constraints
  (always (not (pred_3 obj_10 obj_12)))
)
)

; plan
1. (op_3 obj_02 obj_07 obj_05)
   deleted: (pred_3 obj_02 obj_07)
   added: (pred_3 obj_02 obj_05)
   goals met: 2 of 3
2. (op_1 obj_02 obj_01 obj_05 obj_08)
   deleted: (pred_4 obj_01 obj_05) (pred_2 obj_02 obj_08)
   added: (pred_1 obj_02 obj_01 obj_08)
   goals met: 2 of 3
3. (op_3 obj_02 obj_05 obj_12)
   deleted: (pred_3 obj_02 obj_05)
   added: (pred_3 obj_02 obj_12)
   goals met: 2 of 3
4. (op_2 obj_02 obj_01 obj_12 obj_08)
   deleted: (pred_1 obj_02 obj_01 obj_08)
   added: (pred_4 obj_01 obj_12) (pred_2 obj_02 obj_08)
   goals met: 3 of 3
